Repository: cavalier-king/mahmoud_apps
Catalog: lib/l10n/app_*.arb
Languages: fa

# appTitle
source: Mahmoud Apps
fa: اپ‌های محمود

# homeTitle
source: Home
fa: خانه

source: Hello!
fa: سلام!

# homeHint
source: Open Settings to change language and theme.
fa: برای تغییر زبان و پوسته به تنظیمات بروید.

# homeTip
source: Tip: Settings → Language / Theme
fa: راهنما: تنظیمات ← زبان / پوسته

# settingsTitle
source: Settings
fa: تنظیمات

# settingsGeneral
source: General
fa: عمومی

# settingsLanguage
source: Language
fa: زبان

# settingsChooseLanguage
source: Choose app language
fa: انتخاب زبان برنامه

# settingsCurrent
source: Current: {value}
fa: وضعیت فعلی: {value}

# settingsTheme
source: Theme
fa: پوسته

# settingsChooseTheme
source: Choose app appearance
fa: انتخاب ظاهر برنامه

# themeDark
source: Dark
fa: تیره

# themeLight
source: Light
fa: روشن

# languageAuto
source: Auto
fa: خودکار

# tabScanner
source: Scanner
fa: اسکنر

# tabVault
source: Vault
fa: گاوصندوق

# tabConverter
source: Converter
fa: تبدیل‌واحد

# scannerHistory
source: Scan history
fa: تاریخچه اسکن

source: History
fa: تاریخچه

source: Torch
fa: فلش

source: Scanned
fa: اسکن شد

source: Copy
fa: کپی

source: Copied
fa: کپی شد

source: OK
fa: باشه

source: Clear
fa: پاک کردن

source: Empty
fa: خالی

source: Cancel
fa: انصراف

source: Save
fa: ذخیره

source: Delete
fa: حذف

source: Deleted
fa: حذف شد

source: Set PIN
fa: تنظیم پین

source: Enter PIN
fa: پین را وارد کنید

source: Confirm PIN
fa: تکرار پین

# pinMismatch
source: PINs do not match
fa: پین‌ها یکسان نیستند

source: Wrong PIN
fa: پین اشتباه است

source: Unlock vault
fa: باز کردن گاوصندوق

# vaultLocked
source: Vault is locked
fa: گاوصندوق قفل است

# vaultNeedPin
source: For security, set a PIN for your vault.
fa: برای امنیت، یک پین برای گاوصندوق تنظیم کنید.

source: Add item
fa: افزودن

# editItem
source: Edit
fa: ویرایش

source: Title
fa: عنوان

source: Username
fa: نام کاربری

source: Password
fa: رمز عبور

source: Note
fa: یادداشت

source: Untitled
fa: بدون عنوان

# convCategory
source: Category
fa: دسته‌بندی

# convLength
source: Length
fa: طول

# convWeight
source: Weight
fa: وزن

# convTemperature
source: Temperature
fa: دما

# convValue
source: Value
fa: مقدار

# convFrom
source: From
fa: از

# convTo
source: To
fa: به

# convResult
source: Result
fa: نتیجه

# tabTools
source: Tools
fa: ابزار متن

# toolsInput
source: Input
fa: ورودی

# toolsInputHint
source: Paste or type your text here…
fa: متن را اینجا وارد یا پیست کنید…

# toolsOutput
source: Output
fa: خروجی

# toolsUppercase
source: UPPERCASE
fa: حروف بزرگ

# toolsLowercase
source: lowercase
fa: حروف کوچک

# toolsRemoveExtraSpaces
source: Remove extra spaces
fa: حذف فاصله‌های اضافی

# toolsSortLines
source: Sort lines
fa: مرتب‌سازی خط‌ها

# toolsReverse
source: Reverse
fa: برعکس کردن

# toolsBase64Encode
source: Base64 Encode
fa: رمزگذاری Base64

# toolsBase64Decode
source: Base64 Decode
fa: رمزگشایی Base64

# toolsInvalidBase64
source: Invalid Base64 input
fa: ورودی Base64 نامعتبر است

# toolsChars
source: Chars
fa: کاراکتر

# toolsWords
source: Words
fa: کلمه

# toolsLines
source: Lines
fa: خط

# toolCleanTitle
source: Clean text
fa: تمیز کردن متن

# toolCleanDesc
source: Removes extra spaces and empty lines. Perfect for WhatsApp/Telegram copied text.
fa: فاصله‌های اضافی و خط‌های خالی را حذف می‌کند. مناسب متن کپی‌شده از واتساپ/تلگرام.

# hintPasteOrType
source: Paste or type your text here...
fa: متن را اینجا بچسبانید یا تایپ کنید...

# actionPaste
source: Paste
fa: چسباندن

# actionClear
source: Clear
fa: پاک کردن

# actionClean
source: Clean
fa: تمیز کن

# actionCleanAgain
source: Clean again
fa: دوباره تمیز کن

# actionCopy
source: Copy
fa: کپی

# msgEmptyText
source: Text is empty.
fa: متن خالی است.

# msgCopied
source: Copied!
fa: کپی شد!

# actionRemoveLinks
source: Remove links
fa: حذف لینک‌ها

# actionRemoveEmoji
source: Remove emoji
fa: حذف ایموجی

# actionCleanAll
source: Clean all
fa: تمیزکاری کامل

# tabQrGenerator
source: QR Generator
fa: QR ساز

# qrGeneratorTitle
source: QR Generator
fa: ساخت QR

# qrGeneratorDesc
source: Generate a QR code from any text or link.
fa: از متن یا لینک، کد QR بساز.

# qrInputHint
source: Type text or paste a link...
fa: متن را بنویس یا لینک را پیست کن...

# actionGenerate
source: Generate
fa: ساخت

# actionSave
source: Save
fa: ذخیره

# actionShare
source: Share
fa: اشتراک

# actionSaveGallery
source: Gallery
fa: گالری

# qrSavedTo
source: Saved to
fa: ذخیره شد در

# qrSavedToGallery
source: Saved to gallery
fa: در گالری ذخیره شد

# qrSaveFailed
source: Could not save the QR image.
fa: ذخیره تصویر QR انجام نشد.

# qrShareFailed
source: Could not share the QR image.
fa: اشتراک‌گذاری تصویر QR انجام نشد.

# qrShareText
source: QR code
fa: کد QR

source: QR color
fa: رنگ QR

# toolCleanUrlTitle
source: Clean URL
fa: تمیز کردن لینک

# toolCleanUrlInputHint
source: Paste URL here…
fa: لینک را اینجا وارد کنید…

# toolCleanUrlResult
source: Result
fa: نتیجه

source: Clean URL
fa: لینک تمیز

# toolCleanUrlEmpty
source: No link entered
fa: لینکی وارد نشده است

# toolUrlInspectorTitle
source: URL Inspector
fa: بررسی لینک

# toolUrlInspectorInputHint
source: Paste a link here…
fa: لینک را اینجا وارد کنید…

# toolUrlInspectorInvalid
source: Invalid URL
fa: لینک نامعتبر است

# toolUrlInspectorEmpty
source: Enter a URL to analyze
fa: برای بررسی، یک لینک وارد کنید

# toolUrlInspectorHost
source: Host
fa: دامنه

# toolUrlInspectorScheme
source: Scheme
fa: پروتکل

# toolUrlInspectorPath
source: Path
fa: مسیر

# toolUrlInspectorQuery
source: Query parameters
fa: پارامترهای لینک

# toolUrlInspectorNoQuery
source: No query parameters
fa: پارامتری وجود ندارد

# toolUrlInspectorCopyAll
source: Copy all
fa: کپی همه

source: Open
fa: باز کردن

source: Clean
fa: تمیز کردن

# toolMyIpTitle
source: My IP Address
fa: آی‌پی من

# toolMyIpRefreshPing
source: Refresh ping
fa: آپدیت پینگ

# toolMyIpConnectionIp
source: Connection IP
fa: آی‌پی اتصال

# toolMyIpCountry
source: Country
fa: کشور

# toolMyIpCity
source: City
fa: شهر

# toolMyIpIsp
source: ISP
fa: ارائه‌دهنده اینترنت

# toolMyIpPing
source: Ping
fa: پینگ

# toolMyIpRefreshAll
source: Refresh all
fa: ریفرش همه

# toolMyIpNetwork
source: Network
fa: نوع شبکه

# toolMyIpVpn
source: VPN
fa: وی‌پی‌ان

# toolMyIpRefreshNetwork
source: Refresh network
fa: ریفرش شبکه

# toolMyIpOn
source: ON
fa: روشن

# toolMyIpOff
source: OFF
fa: خاموش

# toolPortCheckTitle
source: Port Check
fa: تست پورت

# toolPortCheckHost
source: Host / Domain
fa: هاست / دامنه

# toolPortCheckPort
source: Port
fa: پورت

# toolPortCheckRun
source: Check
fa: بررسی

# toolPortCheckResult
source: Result
fa: نتیجه

# toolPortCheckNoResult
source: No result yet
fa: هنوز نتیجه‌ای نیست

# toolPortCheckCopy
source: Copy
fa: کپی

# toolPortCheckEnterHost
source: Please enter a host/domain
fa: لطفاً هاست/دامنه را وارد کنید

# toolPortCheckInvalidPort
source: Invalid port (1-65535)
fa: پورت نامعتبر است (۱ تا ۶۵۵۳۵)

# toolPortCheckOpen
source: OPEN
fa: باز

# toolPortCheckClosed
source: CLOSED
fa: بسته

# toolPortCheckTimeout
source: TIMEOUT
fa: تایم‌اوت

# toolPortCheckError
source: ERROR
fa: خطا

# netInfoTitle
source: Net Info
fa: اطلاعات شبکه

# netInfoGeoTitle
source: IP → Geo
fa: مکان IP

# netInfoDnsTitle
source: DNS Lookup
fa: بررسی DNS

# netInfoPingTitle
source: Ping Host
fa: پینگ

# netInfoIp
source: IP Address
fa: آی‌پی

# netInfoDomain
source: Domain
fa: دامنه

# netInfoHost
source: Host
fa: هاست

# netInfoInput
source: Input
fa: ورودی

# netInfoError
source: Error
fa: خطا

# netInfoNoResult
source: No result
fa: بدون نتیجه

# netInfoTimeout
source: Timeout
fa: تایم‌اوت

# netInfoRegistrar
source: Registrar
fa: رجیسترار

# netInfoCreated
source: Created
fa: ساخت

# netInfoExpires
source: Expires
fa: انقضا

# netInfoNameservers
source: Name servers
fa: نیم‌سرورها

# netInfoStatus
source: Status
fa: وضعیت

# netInfoPort
source: Port
fa: پورت

# netInfoAvg
source: Avg
fa: میانگین

# netInfoMin
source: Min
fa: کمینه

# netInfoMax
source: Max
fa: بیشینه

# toolWebInspectorTitle
source: Web Inspector
fa: بازرس وب

# webInspectorHttpHeadersSubtitle
source: Inspect response headers & security headers
fa: بررسی هدرهای پاسخ و هدرهای امنیتی

# webInspectorReputationTitle
source: Reputation
fa: اعتبار دامنه

# webInspectorReputationSubtitle
source: Basic domain safety / reputation checks
fa: بررسی‌های ساده امنیت/اعتبار دامنه

# webInspectorDnsSubtitle
source: Analyze DNS records and hosting hints
fa: تحلیل DNS و نشانه‌های هاستینگ

# webInspectorRedirectSubtitle
source: Follow redirects and SEO-friendly status codes
fa: دنبال‌کردن ریدایرکت‌ها و وضعیت‌های سئو

# webInspectorTip
source: Tip: Each option will open its own tool screen.
fa: راهنما: هر گزینه ابزار خودش را باز می‌کند.

# httpHeadersTitle
source: HTTP Headers
fa: هدرهای HTTP

# httpHeadersUrl
source: URL
fa: آدرس

# httpHeadersInspect
source: Inspect
fa: بررسی

# httpHeadersEnterUrl
source: Please enter a URL
fa: لطفاً یک آدرس وارد کنید

# httpHeadersSecurity
source: Security Headers
fa: هدرهای امنیتی

# httpHeadersAll
source: All Response Headers
fa: همه هدرهای پاسخ

# httpHeadersPresent
source: Present
fa: موجود

# httpHeadersMissing
source: Missing
fa: وجود ندارد

# redirectTitle
source: Redirect & SEO
fa: ریدایرکت و سئو

# redirectUrl
source: URL
fa: آدرس

# redirectCheck
source: Check Redirects
fa: بررسی ریدایرکت

# redirectEnterUrl
source: Please enter a URL
fa: لطفاً یک آدرس وارد کنید

source: Redirect Chain
fa: زنجیره ریدایرکت

# dnsTitle
source: DNS & Hosting
fa: DNS و هاستینگ

# dnsDomain
source: Domain
fa: دامنه

# dnsAnalyze
source: Analyze
fa: تحلیل

# dnsEnterDomain
source: Please enter a domain
fa: لطفاً یک دامنه وارد کنید

# dnsInvalidDomain
source: Invalid domain
fa: دامنه نامعتبر است

# dnsHostingProvider
source: Hosting Provider
fa: ارائه‌دهنده هاست

# dnsResolvedIps
source: Resolved IP Addresses
fa: آی‌پی‌های پیدا شده

# dnsUnknownProvider
source: Unknown / Custom Hosting
fa: نامشخص / هاست اختصاصی

# domainRepTitle
source: Domain Reputation
fa: اعتبار دامنه

# domainRepEnterUrl
source: Please enter a URL or domain
fa: لطفاً آدرس یا دامنه را وارد کنید

# domainRepInvalidDomain
source: Invalid domain
fa: دامنه نامعتبر است

# domainRepUrlOrDomain
source: URL or Domain
fa: آدرس یا دامنه

# domainRepCheck
source: Check
fa: بررسی

# domainRepResolvedIp
source: Resolved IP
fa: آی‌پی پیدا شده

# domainRepPrivateIp
source: Private IP
fa: آی‌پی خصوصی

# domainRepRiskyTld
source: Risky TLD
fa: پسوند مشکوک

# domainRepSummary
source: Summary
fa: جمع‌بندی

# domainRepPotentialRisk
source: Potential risk
fa: احتمال ریسک

# domainRepLikelySafe
source: Likely safe
fa: احتمالاً امن

source: Yes
fa: بله

source: No
fa: خیر
